# SetViewsAndSheets Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageExportOptions..::..SetViewsAndSheets Method
ImageExportOptions Class See Also
---
Sets a list of views and sheets to be exported. Used only when ExportRange is SetOfViews.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetViewsAndSheets(
	IList<ElementId> viewsAndSheets
)
```

Visual Basic
---
```text
Public Sub SetViewsAndSheets ( _
	viewsAndSheets As IList(Of ElementId) _
)
```

Visual C++
---
```text
public:
void SetViewsAndSheets(
	IList<ElementId^>^ viewsAndSheets
)
```

# ### Parameters
viewsAndSheets
    Type: System.Collections.Generic..::..IList<(Of <(<'ElementId>)>)> The ids of the views and sheets.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ImageExportOptions Class
Autodesk.Revit.DB Namespace